finally! something is deployed,
```
$ terraform apply
random_id.webhook[0]: Refreshing state... [id=JeeYdfYupIuFlu2qRv1DR0SOZhgGpA_9GkiMwp_B43ZhYSJgMmHbh3YBKSDDzwMyDKI-bhxdqmnUemki3H68WA]
aws_cloudwatch_log_group.atlantis: Refreshing state... [id=atlantis]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:804464997158:cluster/atlantis]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04de0e2c54a347238]
aws_ssm_parameter.webhook[0]: Refreshing state... [id=/atlantis/webhook/secret]
aws_ssm_parameter.atlantis_github_user_token[0]: Refreshing state... [id=/atlantis/github/user/token]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ca5e342c67b9ef79]
aws_iam_role.ecs_task_execution: Refreshing state... [id=atlantis-ecs_task_execution]
aws_ecs_task_definition.atlantis: Refreshing state... [id=atlantis]
aws_iam_role_policy.ecs_task_access_secrets[0]: Refreshing state... [id=atlantis-ecs_task_execution:ECSTaskAccessSecretsPolicy]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0078474c6a86d87b5]
module.atlantis_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0220fc2a0827d6228]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08387d64e42ea3b1e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00db2dffb5f05844a]
module.alb_http_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-08f46cbb760987c83]
module.alb_https_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0c4e003d1cf43d752]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0d349a086339999c4]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0465354742f4c4d9a]
module.atlantis_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-485113419]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0078474c6a86d87b51080289494]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1486465016]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-1079519087]
module.alb_http_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2510921777]
module.atlantis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-3450935837]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0c8e825cc2a7d2662]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-038da9fe1f4ec0484]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d4ca89383f20854b]
module.alb_https_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4235827236]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-555925035]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2531085047]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-08387d64e42ea3b1e1080289494]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.atlantis will be created
  + resource "aws_ecs_service" "atlantis" {
      + cluster                            = "arn:aws:ecs:us-east-1:804464997158:cluster/atlantis"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "atlantis"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "atlantis"
        }
      + task_definition                    = "atlantis:4"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "atlantis"
          + container_port   = 4141
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0220fc2a0827d6228",
            ]
          + subnets          = (known after apply)
        }
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "atlantis"
      + security_groups            = [
          + "sg-08f46cbb760987c83",
          + "sg-0c4e003d1cf43d752",
        ]
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name" = "atlantis"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + access_logs {
          + enabled = false
        }

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 10
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "atlantis"
      + port                               = 4141
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "atlantis"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0ca5e342c67b9ef79"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-08387d64e42ea3b1e"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0078474c6a86d87b5"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.20.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "atlantis"
        }
      + vpc_id                          = "vpc-0ca5e342c67b9ef79"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.20.102.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "atlantis"
        }
      + vpc_id                          = "vpc-0ca5e342c67b9ef79"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_subnet.private[1]: Creation complete after 1s [id=subnet-0f77b6b24a74a561e]
module.vpc.aws_route_table_association.private[1]: Creating...
module.vpc.aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-03d98bdffd7d96356]
module.vpc.aws_subnet.public[1]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[1]: Creation complete after 12s [id=subnet-005ba4f854290f599]
module.vpc.aws_route_table_association.public[1]: Creating...
module.alb.aws_lb.this[0]: Creating...
module.vpc.aws_route_table_association.public[1]: Creation complete after 0s [id=rtbassoc-0c67de2c074e9e3a1]
module.alb.aws_lb.this[0]: Still creating... [10s elapsed]
module.alb.aws_lb.this[0]: Still creating... [20s elapsed]
module.alb.aws_lb.this[0]: Still creating... [30s elapsed]
module.alb.aws_lb.this[0]: Still creating... [40s elapsed]
module.alb.aws_lb.this[0]: Still creating... [50s elapsed]
module.alb.aws_lb.this[0]: Still creating... [1m0s elapsed]
module.alb.aws_lb.this[0]: Still creating... [1m10s elapsed]
module.alb.aws_lb.this[0]: Still creating... [1m20s elapsed]
module.alb.aws_lb.this[0]: Still creating... [1m30s elapsed]
module.alb.aws_lb.this[0]: Still creating... [1m40s elapsed]
module.alb.aws_lb.this[0]: Still creating... [1m50s elapsed]
module.alb.aws_lb.this[0]: Still creating... [2m0s elapsed]
module.alb.aws_lb.this[0]: Still creating... [2m10s elapsed]
module.alb.aws_lb.this[0]: Creation complete after 2m16s [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:loadbalancer/app/atlantis/4fda4a4ead25d69c]
module.alb.aws_lb_target_group.main[0]: Creating...
module.alb.aws_lb_target_group.main[0]: Creation complete after 2s [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:targetgroup/atlantis/f628ca2a7ecf7e03]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Creating...
aws_ecs_service.atlantis: Creating...
module.alb.aws_lb_listener.frontend_http_tcp[0]: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:listener/app/atlantis/4fda4a4ead25d69c/9d10ca5ce478be17]
aws_ecs_service.atlantis: Creation complete after 1s [id=arn:aws:ecs:us-east-1:804464997158:service/atlantis/atlantis]

Apply complete! Resources: 8 added, 0 changed, 0 destroyed.

```